In [4]:
# --- Install Google Generative AI SDK ---
!pip install google-generativeai

# --- Import library ---
import google.generativeai as genai

# --- Configure your API key ---
genai.configure(api_key="AIzaSyDTvEwKmRwEcrXiJV-pN91S1CVd4QjlcDw")  # replace with your key

# --- Choose the Gemini model ---
model = genai.GenerativeModel("gemini-2.5-flash")

# --- Build a simple agent ---
def ask_agent(prompt):
    response = model.generate_content(prompt)
    return response.text

# --- Test it ---
print("🤖 Agent Ready!")
print(ask_agent("Hello, who are you?"))

Requirement already satisfied: google-generativeai in c:\users\dbtech africa\anaconda3\lib\site-packages (0.8.5)
Requirement already satisfied: google-ai-generativelanguage==0.6.15 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-generativeai) (0.6.15)
Requirement already satisfied: google-api-core in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-generativeai) (2.25.2)
Requirement already satisfied: google-api-python-client in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-generativeai) (2.184.0)
Requirement already satisfied: google-auth>=2.15.0 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-generativeai) (2.41.1)
Requirement already satisfied: protobuf in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-generativeai) (5.29.5)
Requirement already satisfied: pydantic in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from google-generativeai) (2.11.7)
Requirement already satisfied: tqdm in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-generativeai) (4.66.5)
Requirement already satisfied: typing-extensions in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-generativeai) (4.15.0)
Requirement already satisfied: proto-plus<2.0.0dev,>=1.22.3 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-ai-generativelanguage==0.6.15->google-generativeai) (1.26.1)
Requirement already satisfied: googleapis-common-protos<2.0.0,>=1.56.2 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-api-core->google-generativeai) (1.70.0)
Requirement already satisfied: requests<3.0.0,>=2.18.0 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from google-api-core->google-generativeai) (2.31.0)
Requirement already satisfied: grpcio<2.0.0,>=1.33.2 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.10.*,!=2.2.*,!=2.3.*,!=2.4.*,!=2.5.*,!=2.6.*,!=2.7.*,!=2.8.*,!=2.9.*,<3.0.0dev,>=1.34.1->google-ai-generativelanguage==0.6.15->google-generativeai) (1.74.0)
Requirement already satisfied: grpcio-status<2.0.0,>=1.33.2 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.10.*,!=2.2.*,!=2.3.*,!=2.4.*,!=2.5.*,!=2.6.*,!=2.7.*,!=2.8.*,!=2.9.*,<3.0.0dev,>=1.34.1->google-ai-generativelanguage==0.6.15->google-generativeai) (1.71.2)
Requirement already satisfied: cachetools<7.0,>=2.0.0 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-auth>=2.15.0->google-generativeai) (5.3.3)
Requirement already satisfied: pyasn1-modules>=0.2.1 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-auth>=2.15.0->google-generativeai) (0.2.8)
Requirement already satisfied: rsa<5,>=3.1.4 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-auth>=2.15.0->google-generativeai) (4.9.1)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from requests<3.0.0,>=2.18.0->google-api-core->google-generativeai) (3.4.3)
Requirement already satisfied: idna<4,>=2.5 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from requests<3.0.0,>=2.18.0->google-api-core->google-generativeai) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from requests<3.0.0,>=2.18.0->google-api-core->google-generativeai) (2.5.0)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from requests<3.0.0,>=2.18.0->google-api-core->google-generativeai) (2025.8.3)
Requirement already satisfied: pyasn1>=0.1.3 in c:\users\dbtech africa\anaconda3\lib\site-packages (from rsa<5,>=3.1.4->google-auth>=2.15.0->google-generativeai) (0.4.8)
Requirement already satisfied: httplib2<1.0.0,>=0.19.0 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-api-python-client->google-generativeai) (0.31.0)
Requirement already satisfied: google-auth-httplib2<1.0.0,>=0.2.0 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-api-python-client->google-generativeai) (0.2.0)
Requirement already satisfied: uritemplate<5,>=3.0.1 in c:\users\dbtech africa\anaconda3\lib\site-packages (from google-api-python-client->google-generativeai) (4.2.0)
Requirement already satisfied: pyparsing<4,>=3.0.4 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from httplib2<1.0.0,>=0.19.0->google-api-python-client->google-generativeai) (3.2.3)
Requirement already satisfied: annotated-types>=0.6.0 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from pydantic->google-generativeai) (0.7.0)
Requirement already satisfied: pydantic-core==2.33.2 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from pydantic->google-generativeai) (2.33.2)
Requirement already satisfied: typing-inspection>=0.4.0 in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from pydantic->google-generativeai) (0.4.1)
Requirement already satisfied: colorama in c:\users\dbtech africa\appdata\roaming\python\python312\site-packages (from tqdm->google-generativeai) (0.4.6)
🤖 Agent Ready!
Hello! I am a large language model, trained by Google.

In [5]:
# Create a mentor-style AI agent
def mentor_agent(question):
    system_prompt = """
    You are an encouraging mentor for tech learners in Africa.
    Answer simply, with examples, and motivate the student.
    """
    response = model.generate_content(system_prompt + "\nStudent: " + question)
    return response.text

# Try it
print(mentor_agent("Poem Once."))

That's lovely! Writing a poem, even once, shows a fantastic creative spirit.

You know, that creative spark – the one that makes you think about words, rhythm, and how to express an idea – is incredibly valuable in tech too!

Think of it like this:

*   A **poet** carefully chooses words to build a beautiful story or convey a deep feeling.
*   A **coder** carefully chooses lines of code to build a functional app or solve a complex problem.

Both need imagination, a good eye for detail, and a way to structure their thoughts clearly.

Don't ever think your creative side isn't useful in tech. In fact, it makes you a *better* tech learner and innovator. Your ability to think differently, to imagine, and to create will help you design better solutions and approach challenges in unique ways.

Keep nurturing all your talents! They all work together to make you a powerful force for change.

In [3]:
import google.generativeai as genai

genai.configure(api_key="your key please")

models = genai.list_models()
for m in models:
    # Show only those that support generate_content
    if 'generateContent' in m.supported_generation_methods:
        print(m.name)

models/gemini-2.5-pro-preview-03-25
models/gemini-2.5-flash-preview-05-20
models/gemini-2.5-flash
models/gemini-2.5-flash-lite-preview-06-17
models/gemini-2.5-pro-preview-05-06
models/gemini-2.5-pro-preview-06-05
models/gemini-2.5-pro
models/gemini-2.0-flash-exp
models/gemini-2.0-flash
models/gemini-2.0-flash-001
models/gemini-2.0-flash-exp-image-generation
models/gemini-2.0-flash-lite-001
models/gemini-2.0-flash-lite
models/gemini-2.0-flash-preview-image-generation
models/gemini-2.0-flash-lite-preview-02-05
models/gemini-2.0-flash-lite-preview
models/gemini-2.0-pro-exp
models/gemini-2.0-pro-exp-02-05
models/gemini-exp-1206
models/gemini-2.0-flash-thinking-exp-01-21
models/gemini-2.0-flash-thinking-exp
models/gemini-2.0-flash-thinking-exp-1219
models/gemini-2.5-flash-preview-tts
models/gemini-2.5-pro-preview-tts
models/learnlm-2.0-flash-experimental
models/gemma-3-1b-it
models/gemma-3-4b-it
models/gemma-3-12b-it
models/gemma-3-27b-it
models/gemma-3n-e4b-it
models/gemma-3n-e2b-it
models/gemini-flash-latest
models/gemini-flash-lite-latest
models/gemini-pro-latest
models/gemini-2.5-flash-lite
models/gemini-2.5-flash-image-preview
models/gemini-2.5-flash-image
models/gemini-2.5-flash-preview-09-2025
models/gemini-2.5-flash-lite-preview-09-2025
models/gemini-robotics-er-1.5-preview

In [11]:
import re

# === Sanitizer / extractor ===
def extract_sql(model_text: str) -> str:
    """
    Extract the SQL statement from model_text by:
      - grabbing content inside ``` ``` or ```sql ``` if present
      - removing leading 'sql', 'SQL:', or stray backticks
      - returning stripped text
    """
    # 1) Try triple-backtick extraction first
    m = re.search(r'```(?:sql)?\s*(.*?)```', model_text, re.S | re.I)
    if m:
        sql = m.group(1)
    else:
        # remove leading labels like "sql\n" or "SQL:" or "SQL\n"
        sql = re.sub(r'^\s*(?:sql\s*:|sql)\s*', '', model_text, flags=re.I)
        # remove surrounding single backticks and extra whitespace
        sql = sql.strip("` \n\r\t")
    return sql.strip()

# === Basic safety validator ===
def validate_sql(sql: str) -> (bool, str):
    """
    Returns (True, "") if safe; otherwise (False, reason).
    Rules:
      - Must be a SELECT statement (starts with select)
      - Must not contain destructive keywords (insert, update, delete, drop, alter, create, truncate, replace)
      - Must query only the 'students' table
      - Column list must be asterix or allowed columns
    """
    s = sql.strip()
    if s == "":
        return False, "No SQL found in model output."

    low = s.lower()

    # Must start with SELECT
    if not re.match(r'^\s*select\b', low):
        return False, "Only SELECT queries are allowed."

    # Forbidden keywords
    forbidden = ['insert', 'update', 'delete', 'drop', 'alter', 'create', 'truncate', 'replace', 'grant', 'revoke']
    for kw in forbidden:
        if re.search(r'\b' + re.escape(kw) + r'\b', low):
            return False, f"Forbidden keyword detected: {kw}"

    # Must FROM students
    if not re.search(r'\bfrom\s+students\b', low):
        return False, "Query must target the 'students' table only."

    # Validate selected columns
    cols_match = re.search(r'select\s+(.*?)\s+from', s, re.I | re.S)
    if cols_match:
        cols_part = cols_match.group(1)
        # split by commas but keep simple (this is NOT a full SQL parser)
        cols = [c.strip().strip('`"') for c in cols_part.split(',')]
        allowed = {'*','id','name','year','course','employer','city','status'}
        for col in cols:
            # allow simple aggregates like count(*) or count(id) optionally
            if re.match(r'^\w+\s*\(.*\)$', col):
                func = col.split('(')[0].strip().lower()
                # allow a small set of aggregate functions if you want:
                if func not in ('count','max','min','avg','sum'):
                    return False, f"Aggregate function '{func}' not allowed."
                continue
            if col != '*' and col.lower() not in allowed:
                return False, f"Column '{col}' is not allowed."
    else:
        return False, "Could not parse selected columns."

    return True, ""

# === Executor wrapper ===
def run_model_sql_and_fetch(model_text: str, cursor):
    """
    Extracts and validates SQL from model_text then executes using provided DB cursor.
    Returns rows or an error dict.
    """
    sql = extract_sql(model_text)
    print("DEBUG: extracted SQL ->", repr(sql))   # helpful for debugging

    ok, reason = validate_sql(sql)
    if not ok:
        return {"error": reason, "sql": sql}

    try:
        cursor.execute(sql)
        rows = cursor.fetchall()
        colnames = [d[0] for d in cursor.description] if cursor.description else []
        return {"sql": sql, "columns": colnames, "rows": rows}
    except Exception as e:
        return {"error": f"SQL execution error: {e}", "sql": sql}

In [13]:
import mysql.connector

# open connection (fill your credentials)
cnx = mysql.connector.connect(user='root', password='', host='localhost', database='tracer_system')
cur = cnx.cursor()

# suppose 'model_output' is what the LLM returned
model_output = "sql\nSELECT name FROM students WHERE city = 'Nairobi' AND status = 'Employed'"

result = run_model_sql_and_fetch(model_output, cur)
if 'error' in result:
    print("ERROR:", result['error'])
    print("SQL that was attempted:", result.get('sql'))
else:
    print("SQL executed:", result['sql'])
    print("Columns:", result['columns'])
    for r in result['rows']:
        print(r)

cur.close()
cnx.close()

DEBUG: extracted SQL -> "SELECT name FROM students WHERE city = 'Nairobi' AND status = 'Employed'"
SQL executed: SELECT name FROM students WHERE city = 'Nairobi' AND status = 'Employed'
Columns: ['name']
('John Mwangi',)
('Mary Wanjiku',)
('Faith Njoki',)
('Dennis Mwangi',)
('Evelyn Wairimu',)
('Brian Mutua',)
('Joyce Nyambura',)
('Irene Aoko',)

In [1]:
import mysql.connector
import pandas as pd
import google.generativeai as genai
import re

# 1️ Configure your Gemini API Key
genai.configure(api_key="AIzaSyDTvEwKmRwEcrXiJV-pN91S1CVd4QjlcDw")
model = genai.GenerativeModel("gemini-2.5-flash")

# 2️ Connect to your local XAMPP database
cnx = mysql.connector.connect(
    host="localhost",        
    user="root",             
    password="",             
    database="tracer_system" 
)

In [2]:
def ai_query(prompt):
    sql_prompt = f"""
    You are an expert MySQL assistant.
    Translate the following natural-language question into a valid MySQL query
    for a table named 'students' with columns:
    id, name, age, gender, city, course, status.
    Return only the raw SQL query — do NOT include markdown, explanations, or code blocks.
    Question: {prompt}
    """

    # Step 1. Ask Gemini for the SQL query
    response = model.generate_content(sql_prompt)
    sql_raw = response.text.strip()

    # Step 2. Clean markdown formatting if present
    sql = re.sub(r"```[\s\S]*?```", "", sql_raw)
    sql = sql.replace("```sql", "").replace("```", "").strip()
    sql = re.sub(r"^sql", "", sql, flags=re.IGNORECASE).strip()

    print("🤖 Clean SQL Query:\n", sql)

    # Step 3. Execute query and display results
    try:
        cursor = cnx.cursor()
        cursor.execute(sql)
        rows = cursor.fetchall()
        columns = [desc[0] for desc in cursor.description]
        df = pd.DataFrame(rows, columns=columns)
        return df
    except Exception as e:
        return f"Error executing SQL: {e}"

In [4]:
ai_query("Show me all students from Nairobi course ict who are employed")

🤖 Clean SQL Query:
 SELECT * FROM students WHERE city = 'Nairobi' AND course = 'ict' AND status = 'employed'

   id           name  year course         employer     city    status
0   2   Mary Wanjiku  2023    ICT        Safaricom  Nairobi  Employed
1  10    Faith Njoki  2023    ICT     Google Kenya  Nairobi  Employed
2  15  Dennis Mwangi  2021    ICT        IBM Kenya  Nairobi  Employed
3  23    Brian Mutua  2022    ICT  Microsoft Kenya  Nairobi  Employed
4  30     Irene Aoko  2022    ICT           Andela  Nairobi  Employed

In [11]:
ai_query("Show me all students")

🤖 Clean SQL Query:
 SELECT * FROM students

,id,name,year,course,employer,city,status
0,1,John Mwangi,2022,Electrical Engineering,Kenya Power,Nairobi,Employed
1,2,Mary Wanjiku,2023,ICT,Safaricom,Nairobi,Employed
2,3,Peter Otieno,2021,Automotive Engineering,Toyota Kenya,Mombasa,Employed
3,4,Sarah Achieng,2023,Business Management,Equity Bank,Kisumu,Employed
4,5,Kevin Kamau,2022,Hospitality Management,Sarova Hotels,Nakuru,Employed
5,6,Jane Njeri,2023,ICT,Unemployed,Thika,Unemployed
6,7,Brian Ouma,2022,Welding and Fabrication,Bamburi Cement,Mombasa,Employed
7,8,Diana Chebet,2023,Fashion Design,Self-Employed,Eldoret,Self-Employed
8,9,Samuel Kiptoo,2021,Electrical Engineering,KenGen,Naivasha,Employed
9,10,Faith Njoki,2023,ICT,Google Kenya,Nairobi,Employed
10,11,George Maina,2021,Mechanical Engineering,KPA,Mombasa,Employed
11,12,Lucy Wambui,2022,Accounting,KCB Bank,Nakuru,Employed
12,13,John Ochieng,2023,ICT,Freelancer,Kisumu,Self-Employed
13,14,Beatrice Atieno,2022,Tourism Management,Unemployed,Siaya,Unemployed
14,15,Dennis Mwangi,2021,ICT,IBM Kenya,Nairobi,Employed
15,16,Cynthia Mutheu,2023,Culinary Arts,Self-Employed,Machakos,Self-Employed
16,17,Alex Ndung’u,2022,Electrical Engineering,Unemployed,Nyeri,Unemployed
17,18,Evelyn Wairimu,2023,Business Management,Family Bank,Nairobi,Employed
18,19,Collins Omondi,2021,Automotive Engineering,Isuzu East Africa,Mombasa,Employed
19,20,Grace Naliaka,2023,Fashion Design,Unemployed,Kakamega,Unemployed
20,21,Paul Kibet,2022,Welding and Fabrication,Self-Employed,Eldoret,Self-Employed
21,22,Naomi Cherono,2021,Electrical Engineering,Kenya Power,Kericho,Employed
22,23,Brian Mutua,2022,ICT,Microsoft Kenya,Nairobi,Employed
23,24,Mercy Muthoni,2023,Accounting,Unemployed,Murang’a,Unemployed
24,25,James Kipruto,2021,Mechanical Engineering,Unemployed,Eldoret,Unemployed
25,26,Joyce Nyambura,2022,Hospitality Management,Villa Rosa Kempinski,Nairobi,Employed
26,27,Victor Wekesa,2023,ICT,Unemployed,Bungoma,Unemployed
27,28,Agnes Anyango,2021,Business Management,Unemployed,Homa Bay,Unemployed
28,29,Leonard Mutiso,2023,Automotive Engineering,Self-Employed,Kitui,Self-Employed
29,30,Irene Aoko,2022,ICT,Andela,Nairobi,Employed

In [12]:
ai_query("Show me all the courses")

🤖 Clean SQL Query:
 SELECT DISTINCT course FROM students

                     course
0    Electrical Engineering
1                       ICT
2    Automotive Engineering
3       Business Management
4    Hospitality Management
5   Welding and Fabrication
6            Fashion Design
7    Mechanical Engineering
8                Accounting
9        Tourism Management
10            Culinary Arts

In [5]:
ai_query("Create Group os Students by city and Show me")

🤖 Clean SQL Query:
 SELECT city, COUNT(id) AS number_of_students FROM students GROUP BY city

        city  number_of_students
0    Bungoma                   1
1    Eldoret                   3
2   Homa Bay                   1
3   Kakamega                   1
4    Kericho                   1
5     Kisumu                   2
6      Kitui                   1
7   Machakos                   1
8    Mombasa                   4
9   Murang’a                   1
10   Nairobi                   8
11  Naivasha                   1
12    Nakuru                   2
13     Nyeri                   1
14     Siaya                   1
15     Thika                   1

In [44]:
# -------------------------------------------
# 🤖 Day 2.5: AI Agent with Reasoning + Explanation
# -------------------------------------------

import google.generativeai as genai
import mysql.connector
import pandas as pd
import json, re

# 1️⃣ Configure Gemini API
genai.configure(api_key="your key please")

# 2️⃣ Connect to your XAMPP MySQL database
cnx = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",         # leave blank if no password
    database="tracer_system"  # update to your database name
)

# 3️⃣ Define the full reasoning agent
def reasoning_agent(question):
    prompt = f"""
    You are an intelligent MySQL reasoning assistant.
    You have access to a table called `students` with these columns:
    id, name, year, course, employer, city, status.

    You must:
    1. Explain your reasoning (why you’ll query certain columns/filters),
    2. Write an executable MySQL query (no markdown or code fences),
    3. Finally, explain the result in simple English once you see it.

    Return JSON in this exact format:
    {{
      "reasoning": "Step-by-step reasoning here",
      "sql": "SELECT ...",
      "explanation": "Explanation of what the result means"
    }}

    Question: {question}
    """

    # Call Gemini
    model = genai.GenerativeModel("gemini-2.5-flash")
    response = model.generate_content(prompt)
    text = response.text.strip()

    # Parse JSON safely
    try:
        json_text = re.search(r'\{.*\}', text, re.S).group()
        data = json.loads(json_text)
        reasoning = data.get("reasoning", "").strip()
        sql = data.get("sql", "").strip()
        explanation = data.get("explanation", "").strip()
    except Exception as e:
        reasoning = "❌ Could not extract reasoning."
        sql = f"SELECT 'Error: No reasoning provided.' AS SystemMessage;"
        explanation = "No explanation available."

    # Show reasoning and SQL
    print("🧠 Reasoning:\n", reasoning)
    print("\n🧩 SQL Query:\n", sql)

    # Execute query
    try:
        df = pd.read_sql(sql, cnx)
        print("\n📊 Query Results:")
        display(df)

        # 🗣️ Generate explanation based on results
        if not df.empty:
            # Add contextual explanation using Gemini again
            result_summary = df.to_string(index=False)
            explanation_prompt = f"""
            You are an analyst. Based on this table result, explain briefly in simple English what it means:
            {result_summary}
            """
            explanation_response = model.generate_content(explanation_prompt)
            print("\n🗣️ Explanation:\n", explanation_response.text.strip())
        else:
            print("\n🗣️ Explanation: No matching records found.")

    except Exception as e:
        print(f"❌ SQL Execution Error: {e}")

In [35]:
reasoning_agent("Show me the number of all students")

🧠 Reasoning:
 To find the total number of all students, I need to count all the rows in the 'students' table. The `COUNT(*)` function is appropriate for this as it counts every row, giving me the total count of students without needing to specify any particular column or apply any filters.

🧩 SQL Query:
 SELECT COUNT(*) AS total_students FROM students;

📊 Query Results:

C:\Users\DBTECH AFRICA\AppData\Local\Temp\ipykernel_22328\768130401.py:66: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, cnx)

   total_students
0              30

🗣️ Explanation:
 This table simply means that **there are 30 students in total.**

In [36]:
reasoning_agent("show me all the courses")

🧠 Reasoning:
 The user is asking to see 'all the courses'. This implies a list of distinct course names rather than every single course entry associated with each student. To achieve this, I will select the `course` column and use the `DISTINCT` keyword to ensure that each course name appears only once in the result set.

🧩 SQL Query:
 SELECT DISTINCT course FROM students;

📊 Query Results:

C:\Users\DBTECH AFRICA\AppData\Local\Temp\ipykernel_22328\768130401.py:66: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, cnx)

                     course
0    Electrical Engineering
1                       ICT
2    Automotive Engineering
3       Business Management
4    Hospitality Management
5   Welding and Fabrication
6            Fashion Design
7    Mechanical Engineering
8                Accounting
9        Tourism Management
10            Culinary Arts

🗣️ Explanation:
 This table is a **simple list of various courses or programs of study.**

It shows different fields, from engineering disciplines (Electrical, Mechanical, Automotive), to business, hospitality, IT, and vocational skills (Welding, Fashion Design, Culinary Arts).

**In short, it tells us *what* courses are available, but nothing about their popularity, enrollment numbers, or where they are offered.**

In [37]:
reasoning_agent("show Me all courses with their popularity and where they are offered")

🧠 Reasoning:
 To show all courses with their popularity, I need to count the total number of students for each unique course. This requires using the `COUNT(id)` aggregate function and grouping the results by the `course` column. To show 'where they are offered,' I interpret this as the cities where students enrolled in that specific course are located. Since a course can be taken by students from various cities, I will use `GROUP_CONCAT(DISTINCT city)` to list all unique cities associated with each course. Finally, ordering the results by popularity will make it easy to see the most popular courses first.

🧩 SQL Query:
 SELECT course, COUNT(id) AS popularity, GROUP_CONCAT(DISTINCT city ORDER BY city) AS cities_offered_in FROM students GROUP BY course ORDER BY popularity DESC, course;

📊 Query Results:

C:\Users\DBTECH AFRICA\AppData\Local\Temp\ipykernel_22328\768130401.py:66: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, cnx)

                     course  popularity               cities_offered_in
0                       ICT           8    Bungoma,Kisumu,Nairobi,Thika
1    Electrical Engineering           4  Kericho,Nairobi,Naivasha,Nyeri
2    Automotive Engineering           3                   Kitui,Mombasa
3       Business Management           3         Homa Bay,Kisumu,Nairobi
4                Accounting           2                 Murang’a,Nakuru
5            Fashion Design           2                Eldoret,Kakamega
6    Hospitality Management           2                  Nairobi,Nakuru
7    Mechanical Engineering           2                 Eldoret,Mombasa
8   Welding and Fabrication           2                 Eldoret,Mombasa
9             Culinary Arts           1                        Machakos
10       Tourism Management           1                           Siaya

🗣️ Explanation:
 This table shows the **availability and geographical reach** of different academic courses.

Here's what it means:

1.  **"Popularity" (Availability):** This number likely indicates how many different locations (or institutions, if each number represents one) offer that specific course. A higher number means it's more widely available.
2.  **Most Available Course:** **ICT** is by far the most widely available course, offered in 8 different cities (Bungoma, Kisumu, Nairobi, Thika).
3.  **Least Available Courses:** **Culinary Arts** (Machakos) and **Tourism Management** (Siaya) are currently offered in only one city each, suggesting very limited availability.
4.  **Major Education Hub:** **Nairobi** stands out as a central city, offering many different courses (ICT, Electrical Engineering, Business Management, Hospitality Management), indicating it's a key educational center.
5.  **Varied Availability:** Other courses like Electrical Engineering (4 cities) and Automotive Engineering (3 cities) have moderate availability, while several others (e.g., Accounting, Fashion Design) are available in only two cities.

In short, the data helps understand which courses are broadly accessible across various cities and which might require students to relocate to specific areas.

In [38]:
reasoning_agent("show Me all courses with their popularity and where they are offered and use some histogram visualization for the results fetchedd from the table")

🧠 Reasoning:
 To show all courses with their popularity, I need to count the number of students enrolled in each course. This requires selecting the `course` column and using an aggregate function `COUNT(id)` (or `COUNT(*)`) grouped by `course`. To identify 'where they are offered,' I'll concatenate the distinct cities where students taking that specific course reside, using `GROUP_CONCAT(DISTINCT city)`. The 'popularity' column will represent the count, which can be used for the bar heights in a histogram. The MySQL query will provide the data, not the actual visualization. I will order the results by popularity in descending order to easily see the most popular courses.

🧩 SQL Query:
 SELECT course, COUNT(id) AS popularity, GROUP_CONCAT(DISTINCT city ORDER BY city SEPARATOR ', ') AS offered_in_cities FROM students GROUP BY course ORDER BY popularity DESC, course;

📊 Query Results:

C:\Users\DBTECH AFRICA\AppData\Local\Temp\ipykernel_22328\768130401.py:66: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, cnx)

                     course  popularity                  offered_in_cities
0                       ICT           8    Bungoma, Kisumu, Nairobi, Thika
1    Electrical Engineering           4  Kericho, Nairobi, Naivasha, Nyeri
2    Automotive Engineering           3                     Kitui, Mombasa
3       Business Management           3          Homa Bay, Kisumu, Nairobi
4                Accounting           2                   Murang’a, Nakuru
5            Fashion Design           2                  Eldoret, Kakamega
6    Hospitality Management           2                    Nairobi, Nakuru
7    Mechanical Engineering           2                   Eldoret, Mombasa
8   Welding and Fabrication           2                   Eldoret, Mombasa
9             Culinary Arts           1                           Machakos
10       Tourism Management           1                              Siaya

🗣️ Explanation:
 This table shows the **availability and geographical reach** of different courses.

**In simple terms:**

*   **ICT is by far the most widely offered course**, available in 8 different cities, indicating its high popularity or widespread provision.
*   **Electrical Engineering is the next most common**, offered in 4 cities.
*   Most other courses, like Automotive Engineering and Business Management (3 cities), or Accounting and Fashion Design (2 cities), have **more limited availability**.
*   **Culinary Arts and Tourism Management are the least accessible**, each offered in only one specific city, suggesting they are very niche or localized offerings.

In [39]:
reasoning_agent("describe the entire table details")

🧠 Reasoning:
 The user wants to 'describe the entire table details'. In MySQL, the `DESCRIBE` command is used to retrieve information about the columns of a table, including their names, data types, nullability, key information, default values, and any extra attributes (like auto_increment). This command provides the schema definition for the specified table.

🧩 SQL Query:
 DESCRIBE students

📊 Query Results:

C:\Users\DBTECH AFRICA\AppData\Local\Temp\ipykernel_22328\768130401.py:66: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, cnx)

      Field          Type Null  Key Default           Extra
0        id       int(11)   NO  PRI    None  auto_increment
1      name  varchar(100)  YES         None
2      year       int(11)  YES         None
3    course  varchar(100)  YES         None
4  employer  varchar(100)  YES         None
5      city   varchar(50)  YES         None
6    status   varchar(50)  YES         None

🗣️ Explanation:
 This table describes the structure of a database table, likely for tracking individuals, possibly students or alumni, and their academic/employment details.

Here's a simple breakdown:

*   **`id`**: This is a unique identification number for each person in the table. It's a whole number, cannot be left empty, and is automatically generated and incremented by the system every time a new person is added.
*   **`name`**: Stores the person's name as text (up to 100 characters). This field is optional, meaning it can be left blank.
*   **`year`**: Stores a year (e.g., graduation year) as a whole number. This field is also optional.
*   **`course`**: Stores the course of study as text (up to 100 characters). This field is optional.
*   **`employer`**: Stores the name of their employer as text (up to 100 characters). This field is optional.
*   **`city`**: Stores the city as text (up to 50 characters). This field is optional.
*   **`status`**: Stores their current status (e.g., 'employed', 'student') as text (up to 50 characters). This field is optional.

**In essence:** Each record in this table will have a unique, automatically assigned ID. All other pieces of information about the person (their name, year, course, employer, city, and status) are optional and can be left empty if the data is not available.

In [40]:
reasoning_agent("all students grouped in town and the courses they are in")

🧠 Reasoning:
 To show all students grouped by their city and the courses they are taking, I need to select the `city`, `name`, and `course` columns from the `students` table. To achieve the 'grouped in town' effect, I will order the results by the `city` column, so all students from the same city appear consecutively.

🧩 SQL Query:
 SELECT city, name, course FROM students ORDER BY city, name;

📊 Query Results:

C:\Users\DBTECH AFRICA\AppData\Local\Temp\ipykernel_22328\768130401.py:66: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, cnx)

        city             name                   course
0    Bungoma    Victor Wekesa                      ICT
1    Eldoret     Diana Chebet           Fashion Design
2    Eldoret    James Kipruto   Mechanical Engineering
3    Eldoret       Paul Kibet  Welding and Fabrication
4   Homa Bay    Agnes Anyango      Business Management
5   Kakamega    Grace Naliaka           Fashion Design
6    Kericho    Naomi Cherono   Electrical Engineering
7     Kisumu     John Ochieng                      ICT
8     Kisumu    Sarah Achieng      Business Management
9      Kitui   Leonard Mutiso   Automotive Engineering
10  Machakos   Cynthia Mutheu            Culinary Arts
11   Mombasa       Brian Ouma  Welding and Fabrication
12   Mombasa   Collins Omondi   Automotive Engineering
13   Mombasa     George Maina   Mechanical Engineering
14   Mombasa     Peter Otieno   Automotive Engineering
15  Murang’a    Mercy Muthoni               Accounting
16   Nairobi      Brian Mutua                      ICT
17   Nairobi    Dennis Mwangi                      ICT
18   Nairobi   Evelyn Wairimu      Business Management
19   Nairobi      Faith Njoki                      ICT
20   Nairobi       Irene Aoko                      ICT
21   Nairobi      John Mwangi   Electrical Engineering
22   Nairobi   Joyce Nyambura   Hospitality Management
23   Nairobi     Mary Wanjiku                      ICT
24  Naivasha    Samuel Kiptoo   Electrical Engineering
25    Nakuru      Kevin Kamau   Hospitality Management
26    Nakuru      Lucy Wambui               Accounting
27     Nyeri     Alex Ndung’u   Electrical Engineering
28     Siaya  Beatrice Atieno       Tourism Management
29     Thika       Jane Njeri                      ICT

🗣️ Explanation:
 This table lists individuals, their city of residence, and the course they are currently pursuing.

**Key Observations:**
*   **Most Represented City:** Nairobi has the highest number of individuals listed (8).
*   **Most Popular Course:** "ICT" is by far the most common course, appearing 9 times.
*   **Diversity:** The data showcases a wide range of courses (17 different types) and covers individuals from 19 different cities across Kenya.

In [45]:
reasoning_agent("Create a document describing Beatrice Atieno")

🧠 Reasoning:
 To create a document describing 'Beatrice Atieno', I need to retrieve all available information about her from the `students` table. This means selecting all columns (`*`) and filtering the records where the `name` column is 'Beatrice Atieno'.

🧩 SQL Query:
 SELECT * FROM students WHERE name = 'Beatrice Atieno'

📊 Query Results:

C:\Users\DBTECH AFRICA\AppData\Local\Temp\ipykernel_22328\768130401.py:66: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, cnx)

,id,name,year,course,employer,city,status
0,14,Beatrice Atieno,2022,Tourism Management,Unemployed,Siaya,Unemployed

🗣️ Explanation:
 This record indicates that **Beatrice Atieno**, who completed a **Tourism Management** course in **2022**, is currently **unemployed** and is located in **Siaya**.